
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13343574184)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.prod__k8s_nodes.proxmox_vm_qemu.worker[&#34;1&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prod__k8s_nodes.proxmox_vm_qemu.worker["1"] is tainted, so must be replaced
-/+ resource "proxmox_vm_qemu" "worker" {
      ~ boot                   = "order=virtio0;ide0;net0" -> (known after apply)
      + bootdisk               = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "pve-01/qemu/821" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "prod-k8s-wk-01"
      ~ reboot_required        = false -> (known after apply)
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      ~ tags                   = "terraform;k8s;worker;prod" -> "prod;terraform;k8s;worker"
      ~ unused_disk            = [] -> (known after apply)
      ~ vm_state               = "stopped" -> "running"
        # (40 unchanged attributes hidden)

      ~ disks {
          ~ virtio {
              ~ virtio0 {
                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (19 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:7a:0d:04" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "32c1a2ff-ab65-4500-9668-105ee87a64a2" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - memory = 0 -> null
          - type   = "serial0" -> null
        }
      + vga {
          + type = "serial0"
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + prod__k8s_worker_nodes        = [
      + {
          + ip0     = (known after apply)
          + vm_name = "prod-k8s-wk-01"
        },
    ]
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":79,"Program":"tfcmt","SHA1":"67d509eea87fbc796359dec823c72dd1e47eb2b2","Vars":{},"WorkflowName":"Terraform CI"} -->